Hi there, yes. I had mentioned in the main body that it was with the `aws_key_pair` resource that is used to import a key pair into EC2. I am not able to use an ED25519 key generated with `ssh-keygen`, but I am able to use a RSA key generated in the same manner.

I have tried supplying the ED25519 key normally and as base64 encoded, and neither work.

Providers have endpoints set to http://localhost:4566 where localstack is running.

Sample TF code:
```hcl
resource "aws_key_pair" "fake_key_pair" {
  key_name   = "test-key"
  public_key = "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIImv2SB05uBF88J5NsfbfZ+XiMUpvMMhMfgC4qPC00K0 fake-key for module tests"
}
```
Error from running the code:
```
❯ terraform apply -auto-approve

Terraform used the selected providers to generate the following execution plan. Resource actions are
indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_key_pair.fake_key_pair will be created
  + resource "aws_key_pair" "fake_key_pair" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "test-key"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIImv2SB05uBF88J5NsfbfZ+XiMUpvMMhMfgC4qPC00K0 fake-key for module tests"
      + tags_all        = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
aws_key_pair.fake_key_pair: Creating...
╷
│ Warning: AWS account ID not found for provider
│
│   with provider["registry.terraform.io/hashicorp/aws"],
│   on providers.tf line 1, in provider "aws":
│    1: provider "aws" {
│
│ See https://www.terraform.io/docs/providers/aws/index.html#skip_requesting_account_id for
│ implications.
│
│ (and one more similar warning elsewhere)
╵
╷
│ Error: importing EC2 Key Pair (test-key): InvalidKeyPair.Format: Key is not in valid OpenSSH public key format
│ 	status code: 400, request id: 6eb5f484-4ad8-4824-a4d3-50bc36ec8ac5
│
│   with aws_key_pair.fake_key_pair,
│   on main.tf line 1, in resource "aws_key_pair" "fake_key_pair":
│    1: resource "aws_key_pair" "fake_key_pair" {
│
╵
```
